Repository: BenderBlog/traintime_pda
Catalog: watchOS/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

source: %@ %d 项
en: %1$@ · Events: %2$d
zh_hant: %1$@ %2$d 項

source: %@ %d 项 · 还剩 %d 项
en: %1$@ · Events: %2$d · Left: %3$d
zh_hant: %1$@ %2$d 項 · 還剩 %3$d 項

source: %@ 全部结束
en: Done at %@
zh_hant: %@ 全部結束

source: %1$@，第%2$lld到第%3$lld节
en: %1$@, periods %2$lld–%3$lld
zh_hant: %1$@，第%2$lld到第%3$lld節

source: App 操作教程
en: App tutorial
zh_hant: App 操作教學

source: Apple Watch 课表
en: Apple Watch Schedule
zh_hant: Apple Watch 課表

source: 上一项
en: Previous item
zh_hant: 上一項

source: 上课
en: Starts
zh_hant: 上課

source: 下一场考试
en: Next exam
zh_hant: 下一場考試

source: 下一次 %@
en: Next: %@

source: 下一步添加示意
en: Next setup step
zh_hant: 下一步加入示意

source: 下一节
en: Up next
zh_hant: 下一節

source: 下一项
en: Next item
zh_hant: 下一項

source: 下一项实验
en: Next lab
zh_hant: 下一項實驗

source: 下课
en: Ends
zh_hant: 下課

source: 今日
en: Today

source: 今日安排已完成
en: Done for today

source: 今日已下课
en: Done for today
zh_hant: 今日已下課

source: 今日无课
en: No classes today
zh_hant: 今日無課

source: 今日概览待同步
en: Today’s summary needs a sync
zh_hant: 今日概覽待同步

source: 今日没有安排
en: Nothing scheduled today
zh_hant: 今日沒有安排

source: 今日还剩 %d 项
en: Events left today: %d
zh_hant: 今日還剩 %d 項

source: 今日还剩 %lld 项
en: Today: %lld left
zh_hant: 今日還剩 %lld 項

source: 从手机刷新
en: Refresh from iPhone
zh_hant: 從手機重新整理

source: 使用指南
en: Guides

source: 全学期课表无法合并
en: Unable to merge the semester schedule
zh_hant: 全學期課表無法合併

source: 关闭新手引导提示
en: Dismiss onboarding tip
zh_hant: 關閉新手引導提示

source: 关闭缓存提示
en: Dismiss cached schedule notice
zh_hant: 關閉快取課表提示

source: 关闭详情
en: Close Details
zh_hant: 關閉詳情

source: 关闭课程详情
en: Close class details
zh_hant: 關閉課程詳情

source: 关闭课表过期提示
en: Dismiss outdated schedule notice
zh_hant: 關閉課表過期提示

source: 切换当前与下一节课
en: Switch current and next class
zh_hant: 切換當前與下一節課

source: 切换视图
en: Switch View
zh_hant: 切換檢視

source: 切换课表视图
en: Switch schedule view
zh_hant: 切換課表檢視

source: 刷新课表
en: Refresh Schedule
zh_hant: 重新整理課表

source: 即将上课
en: Starting soon
zh_hant: 即將上課

source: 同步失败：%@
en: Sync failed: %@
zh_hant: 同步失敗：%@

source: 同步完成
en: Sync Complete

source: 后天
en: In 2 days
zh_hant: 後天

source: 后续课表待同步
en: Sync upcoming schedule
zh_hant: 後續課表待同步

source: 周视图
en: Week View
zh_hant: 週檢視

source: 圆形
en: Circle
zh_hant: 圓形

source: 圆形：快速查看时间与地点。
en: Circle: see the time and room quickly.
zh_hant: 圓形：快速查看時間與地點。

source: 地点待定
en: Location TBD
zh_hant: 地點待定

source: 复杂功能
en: Complications
zh_hant: 複雜功能

source: 好
en: OK

source: 学期尚未开始
en: Term not started
zh_hant: 學期尚未開始

source: 学期结束啦
en: Term finished
zh_hant: 學期結束啦

source: 完成
en: Done

source: 实验
en: Experiment
zh_hant: 實驗

source: 小组件使用指南
en: Widget guide
zh_hant: 小工具使用指南

source: 已加载缓存课表
en: Cached schedule loaded
zh_hant: 已載入快取課表

source: 已完成 %d 项
en: %d completed
zh_hant: 已完成 %d 項

source: 底层数据已准备完成
en: Schedule data is ready
zh_hant: 底層資料已準備完成

source: 座位 %@
en: Seat %@

source: 当前课程 ID
en: Current Class ID
zh_hant: 當前課程 ID

source: 当天没有课程
en: No Classes Today
zh_hant: 當天沒有課程

source: 待做实验 %d 项
en: Upcoming labs: %d
zh_hant: 待做實驗 %d 項

source: 待考 %d 场
en: Upcoming exams: %d
zh_hant: 待考 %d 場

source: 悬浮按钮
en: Controls
zh_hant: 懸浮按鈕

source: 手机端暂无课表，请先刷新手机课表
en: No schedule is available on iPhone. Refresh it first.
zh_hant: 手機端暫無課表，請先重新整理手機課表

source: 手机端暂无课表，请先在 iPhone 打开并刷新课表
en: No schedule is available. Open the app on iPhone and refresh it first.
zh_hant: 手機端暫無課表，請先在 iPhone 開啟並重新整理課表

source: 手机端没有可用的学期课表
en: No semester schedule is available on iPhone
zh_hant: 手機端沒有可用的學期課表

source: 打开手机更新课表
en: Open iPhone to update
zh_hant: 打開手機更新課表

source: 打开日期选择器
en: Open Date Picker
zh_hant: 開啟日期選擇器

source: 把课表放到表盘上
en: Add to watch face
zh_hant: 把課表放到錶面上

source: 抬腕，就知道下一节
en: Your next class
zh_hant: 抬腕，就知道下一節

source: 按住右下角切换按钮三秒，感受逐渐增强的震动。
en: Hold the bottom-right button for 3 seconds as taps strengthen.
zh_hant: 按住右下角切換按鈕三秒，感受逐漸增強的震動。

source: 操作正确
en: Correct action
zh_hant: 操作正確

source: 操作错误
en: Incorrect action
zh_hant: 操作錯誤

source: 旋转数码表冠，以浏览当前课程和下一节课程。
en: Turn the Digital Crown to browse the current and next class.
zh_hant: 旋轉數碼錶冠，以瀏覽目前課程和下一節課程。

source: 旋转数码表冠，以浏览当前页面中的课程。
en: Turn the Digital Crown to browse the courses on this page.
zh_hant: 旋轉數碼錶冠，以瀏覽目前頁面中的課程。

source: 旋转数码表冠，以连续切换前后周。
en: Turn the Digital Crown to move continuously between weeks.
zh_hant: 旋轉數碼錶冠，以連續切換前後週。

source: 旋转数码表冠，以连续切换前后月份。
en: Turn the Digital Crown to move continuously between months.
zh_hant: 旋轉數碼錶冠，以連續切換前後月份。

source: 无法连接 iPhone：%@
en: Unable to connect to iPhone: %@
zh_hant: 無法連線 iPhone：%@

source: 日期选择器
en: Date Picker
zh_hant: 日期選擇器

source: 日视图
en: Day View
zh_hant: 日檢視

source: 日程概览
en: Schedule overview
zh_hant: 日程概覽

source: 日程概览待同步
en: Sync schedule overview
zh_hant: 日程概覽待同步

source: 时间地点
en: Time & Location
zh_hant: 時間地點

source: 明天
en: Tomorrow

source: 明天%@
en: Tomorrow %@

source: 明日
en: Tomorrow

source: 显示上课、下课时间与地点，与课程名称组件保持一致。
en: Class start and end times and location, following the same class as Course Name.
zh_hant: 顯示上課、下課時間與地點，與課程名稱元件保持一致。

source: 显示今日剩余安排、结束时间和本周总数，轻点打开概览。
en: Shows today’s remaining events, finish time, and weekly total. Tap to open Overview.
zh_hant: 顯示今日剩餘安排、結束時間和本週總數，輕點打開概覽。

source: 显示当前或下一节课，上课期间显示课程进度。
en: Shows the current or next class, with progress during class.
zh_hant: 顯示目前或下一節課，上課期間顯示課程進度。

source: 显示课程名称和状态，搭配时间地点组件使用。
en: Class name and status. Pair with Time & Location.
zh_hant: 顯示課程名稱和狀態，搭配時間地點元件使用。

source: 暂无课程
en: No Classes
zh_hant: 暫無課程

source: 暂无课表
en: No Schedule
zh_hant: 暫無課表

source: 暂时无法连接 iPhone
en: Unable to connect to iPhone right now
zh_hant: 暫時無法連線 iPhone

source: 更新请打开手机 XDYou 以同步
en: Open XDYou on iPhone to update
zh_hant: 如需更新，請在手機開啟 XDYou 同步

source: 月视图
en: Month View
zh_hant: 月檢視

source: 本周
en: This week
zh_hant: 本週

source: 本周日程待同步
en: Sync this week’s schedule
zh_hant: 本週日程待同步

source: 本周暂无待考
en: No upcoming exams this week
zh_hant: 本週暫無待考

source: 本周没有后续安排
en: Nothing else scheduled this week
zh_hant: 本週沒有後續安排

source: 本周还有 %d 天安排
en: Scheduled days left this week: %d
zh_hant: 本週還有 %d 天安排

source: 本学期后续无课
en: No more classes this term
zh_hant: 本學期後續無課

source: 本学期结束，开心玩耍吧！
en: Term finished. Enjoy your break!
zh_hant: 本學期結束，開心玩耍吧！

source: 查看课程
en: View Course
zh_hant: 查看課程

source: 概览
en: Overview
zh_hant: 概覽

source: 欢迎使用 XDYou
en: Welcome to XDYou
zh_hant: 歡迎使用 XDYou

source: 正在上课
en: In class
zh_hant: 正在上課

source: 正在从手机同步课表
en: Syncing schedule from iPhone
zh_hant: 正在從手機同步課表

source: 正在刷新
en: Refreshing
zh_hant: 正在重新整理

source: 正在加载新手引导
en: Preparing the guide…
zh_hant: 正在載入新手引導…

source: 正在实验
en: Lab in progress
zh_hant: 正在實驗

source: 正在考试
en: Exam in progress
zh_hant: 正在考試

source: 正在获取今天
en: Fetching Today
zh_hant: 正在取得今天

source: 正在获取整个学期
en: Fetching Semester
zh_hant: 正在取得整個學期

source: 正在获取近 14 天
en: Fetching 14 Days
zh_hant: 正在取得近 14 天

source: 此设备不支持与 iPhone 同步
en: This device does not support iPhone sync
zh_hant: 此裝置不支援與 iPhone 同步

source: 浏览课程
en: Browse Courses
zh_hant: 瀏覽課程

source: 添加后自动更新，轻点组件即可进入概览。
en: Updates automatically. Tap to open Overview.
zh_hant: 加入後自動更新，輕點小工具即可進入概覽。

source: 长按表盘空白处 进入表盘编辑模式
en: Hold the face to start editing.
zh_hant: 長按錶盤空白處 進入錶盤編輯模式

source: 物理实验
en: Physics Experiment
zh_hant: 物理實驗

source: 用手指上下滑动屏幕，以浏览当前课程和下一节课程。
en: Swipe up or down to browse the current and next class.
zh_hant: 用手指上下滑動螢幕，以瀏覽目前課程和下一節課程。

source: 用手指上下滑动屏幕，以浏览当前页面中的课程。
en: Swipe up or down to browse the courses on this page.
zh_hant: 用手指上下滑動螢幕，以瀏覽目前頁面中的課程。

source: 用手指再次轻点页面空白处，以显示右侧操作按钮。
en: Tap an empty area again to show the controls on the right.
zh_hant: 用手指再次輕點頁面空白處，以顯示右側操作按鈕。

source: 用手指左右滑动屏幕，以切换前后周。
en: Swipe left or right to move between weeks.
zh_hant: 用手指左右滑動螢幕，以切換前後週。

source: 用手指左右滑动屏幕，以切换前后日期。
en: Swipe left or right to move between dates.
zh_hant: 用手指左右滑動螢幕，以切換前後日期。

source: 用手指左右滑动屏幕，以切换前后月份。
en: Swipe left or right to move between months.
zh_hant: 用手指左右滑動螢幕，以切換前後月份。

source: 用手指轻点一个日期，以切换到该日期的日视图。
en: Tap a date to open its day view.
zh_hant: 用手指輕點一個日期，以切換到該日期的日視圖。

source: 用手指轻点一个日期，以打开该日期的日视图。
en: Tap a date to open its day view.
zh_hant: 用手指輕點一個日期，以開啟該日期的日視圖。

source: 用手指轻点关闭按钮，以返回周视图。
en: Tap Close to return to Week View.
zh_hant: 用手指輕點關閉按鈕，以返回週視圖。

source: 用手指轻点刷新按钮，以从 iPhone 更新课表。
en: Tap Refresh to update the schedule from your iPhone.
zh_hant: 用手指輕點重新整理按鈕，以從 iPhone 更新課表。

source: 用手指轻点右下角切换按钮，以打开视图目录。
en: Tap the bottom-right view button to open the view menu.
zh_hant: 用手指輕點右下角切換按鈕，以開啟檢視目錄。

source: 用手指轻点右侧箭头，以切换到下一页。
en: Tap the right arrow to go to the next page.
zh_hant: 用手指輕點右側箭頭，以切換到下一頁。

source: 用手指轻点左侧箭头，以切换到上一页。
en: Tap the left arrow to go to the previous page.
zh_hant: 用手指輕點左側箭頭，以切換到上一頁。

source: 用手指轻点页面空白处，以隐藏右侧操作按钮。
en: Tap an empty area to hide the controls on the right.
zh_hant: 用手指輕點頁面空白處，以隱藏右側操作按鈕。

source: 用手指轻点顶部日期标题，以打开日期选择器。
en: Tap the date title at the top to open the date picker.
zh_hant: 用手指輕點頂部日期標題，以開啟日期選擇器。

source: 用手指轻点顶部月份标题，以退出月视图。
en: Tap the month title at the top to exit Month View.
zh_hant: 用手指輕點頂部月份標題，以退出月視圖。

source: 用手指轻点高亮的课程色块，以打开课程详情。
en: Tap the highlighted course block to open course details.
zh_hant: 用手指輕點高亮的課程色塊，以開啟課程詳情。

source: 第 %lld 页，共 %lld 页
en: Page %1$lld of %2$lld
zh_hant: 第 %1$lld 頁，共 %2$lld 頁

source: 第%lld周
en: Week %lld
zh_hant: 第%lld週

source: 第一次载入课表，正在渲染底层数据
en: Preparing your schedule for the first time…
zh_hant: 第一次載入課表，正在準備底層資料

source: 综合课表
en: Smart schedule
zh_hant: 綜合課表

source: 编辑
en: Edit
zh_hant: 編輯

source: 编辑 → 复杂功能
en: Edit → Complications
zh_hant: 編輯 → 複雜功能

source: 翻页
en: Page
zh_hant: 翻頁

source: 考试
en: Exam
zh_hant: 考試

source: 表角
en: Corner
zh_hant: 錶角

source: 请先同步课表
en: Sync your schedule
zh_hant: 請先同步課表

source: 请在手机登录
en: Sign in on iPhone
zh_hant: 請在手機登入

source: 请在配对的 iPhone 上打开应用并刷新课表
en: Open the app on the paired iPhone and refresh the schedule
zh_hant: 請在配對的 iPhone 上開啟 App 並重新整理課表

source: 请打开手机 XDYou 并单击刷新按钮
en: Open XDYou on iPhone and tap Refresh
zh_hant: 請在手機開啟 XDYou 並點一下重新整理按鈕

source: 课程 %d · 考试 %d · 实验 %d
en: Classes %1$d · Exams %2$d · Labs %3$d
zh_hant: 課程 %1$d · 考試 %2$d · 實驗 %3$d

source: 课程列表
en: Schedule
zh_hant: 課程列表

source: 课程名称
en: Class Name
zh_hant: 課程名稱

source: 课程详情
en: Course Details
zh_hant: 課程詳情

source: 课程进度
en: Class Progress
zh_hant: 課程進度

source: 课表分页数据无效，请重新刷新
en: Invalid schedule page. Refresh again.
zh_hant: 課表分頁資料無效，請重新整理

source: 课表可能已过期
en: Schedule May Be Outdated
zh_hant: 課表可能已過期

source: 课表待更新
en: Schedule outdated
zh_hant: 課表待更新

source: 课表数据无法读取
en: Unable to read schedule data
zh_hant: 課表資料無法讀取

source: 轻点以继续
en: Tap to continue
zh_hant: 輕點以繼續

source: 轻点屏幕以开始
en: Tap the screen to begin
zh_hant: 輕點螢幕以開始

source: 还剩
en: Left
zh_hant: 還剩

source: 还剩 %d 项
en: %d left
zh_hant: 還剩 %d 項

source: 还有一个更快的方法
en: There’s a quicker way
zh_hant: 還有一個更快的方法

source: 连续旋转数码表冠并越过课程边界，以连续切换日期。
en: Keep turning the Digital Crown past the course boundary to move between dates.
zh_hant: 持續旋轉數碼錶冠並越過課程邊界，以連續切換日期。

source: 退出
en: Exit

source: 选择 XDYou
en: Choose XDYou
zh_hant: 選擇 XDYou

source: 选择日期
en: Choose a Date
zh_hant: 選擇日期

source: 选择适合你的表盘
en: Find your fit
zh_hant: 選擇適合你的錶面

source: 重新打开引导
en: Replay Guide
zh_hant: 重新開啟引導

source: 长按右下角切换按钮重新进入新手引导
en: Long-press the bottom-right view button to replay the guide
zh_hant: 長按右下角切換按鈕重新進入新手引導

source: 长按表盘
en: Touch and hold the watch face
zh_hant: 長按錶面

source: 长按重新进入新手引导
en: Long-press to replay the guide
zh_hant: 長按重新進入新手引導

source: 长方形
en: Rectangle
zh_hant: 長方形

source: 长方形：课程、时间、地点与教师更完整。
en: Rectangle: course, times, room and teacher together.
zh_hant: 長方形：課程、時間、地點與教師更完整。

source: 表角：沿表盘边缘查看课程与进度。
en: Corner: see the course and progress along the edge.
zh_hant: 錶角：沿錶盤邊緣查看課程與進度。

source: 工程概论 (IV)
en: Introduction to Engineering (IV)
zh_hant: 工程概論 (IV)

source: 切换组件示例
en: Change widget example
zh_hant: 切換組件範例

source: 轻点图片查看其他组件和状态。
en: Tap the image to see more widgets and states.
zh_hant: 點一下圖片查看其他組件與狀態。

source: 教程结束
en: Tutorial complete
zh_hant: 教學結束

source: 开始愉快的使用吧
en: Enjoy using XDYou!
zh_hant: 開始愉快地使用吧

source: 课中看时间和进度 课后显示下一节课
en: Track progress See the next class
zh_hant: 課中看時間與進度 課後顯示下一節課

source: 轻点“编辑” 滑到“复杂功能”
en: Tap Edit, swipe to Complications.
zh_hant: 點一下「編輯」 滑到「複雜功能」

source: 轻点一个组件位置 选择 XDYou 小组件
en: Tap a widget slot Choose XDYou
zh_hant: 點選小工具位置 選擇 XDYou 小工具

source: 沿表盘边缘看课程与进度
en: Class and progress at the edge
zh_hant: 沿錶盤邊緣看課程與進度

source: 课程、时间、地点与教师
en: Class, time, room and teacher
zh_hant: 課程、時間、地點與教師

source: 当前或下一节课的名称
en: Current or next class name
zh_hant: 目前或下一堂課的名稱

source: 今日剩余安排与结束状态
en: Events left and when you're done
zh_hant: 今日剩餘安排與結束狀態

source: 下课时间、地点与进度
en: End time, room and progress
zh_hant: 下課時間、地點與進度

source: 下次上课的时间与地点
en: Time and room for the next class
zh_hant: 下次上課的時間與地點

source: 高等数学
en: Calculus
zh_hant: 高等數學
